# make sure brew is up to date
#brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'zsh'
brew 'jq'
brew 'git'
brew 'tree'
brew 'bfg'
brew 'svn'
brew 'the_silver_searcher'
brew 'rename'
brew 'nmap'
brew 'moreutils'
brew 'pigz'
brew 'shellcheck'
brew 'ucspi-tcp'
brew 'wget'
brew 'node'
brew 'tmux'
brew 'fzf'
brew 'ripgrep'
brew 'neofetch'
brew 'hub'
brew 'trash'
brew 'cmake'
brew 'ssh-copy-id'
brew 'awscli'
brew 'kind'
brew 'k9s'
brew 'gh'
brew 'mas'
brew 'tldr'
brew 'thefuck'
brew 'go'
brew 'python'
brew 'python3'
brew 'packer'
brew 'terraform'
brew 'vault'
brew 'pulumi'
brew 'pyenv'
brew 'shpotify'
brew 'httpie'
brew 'ngrep'
brew 'gnupg'


# databases
brew 'mongodb/brew/mongodb-community'
brew 'mysql'
brew 'redis'
brew 'sqlite'
brew 'postgresql'


# Apps
cask 'iterm2'
cask 'alacritty'
cask 'macvim'
cask 'rectangle'
cask 'tunnelblick'

# cask 'docker' # https://docs.docker.com/docker-for-mac/apple-silicon/
cask 'pycharm'
cask 'rubymine'

cask 'r'
cask 'rstudio'

cask 'firefox'
cask 'spotify'

cask 'gephi'
cask 'gyazo'
cask 'handbrake'
cask 'imagealpha'
cask 'licecap'
cask 'transmission'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'google-drive'
cask 'visual-studio-code'
# cask 'slack' # brew version doesnt work
cask 'google-chrome'
cask 'sublime-text'
cask 'mongodb-compass'
cask 'mac2imgur'
cask 'dropbox'
cask 'caffeine'
cask 'postman'

cask 'jumpcut'
cask 'insomnia'


# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'


# Install Mac App Store apps
mas 'Amphetamine', id: 937984704
mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959
mas 'LastPass', id: 926036361
